package hw27_files;


import hw27_files.classes.PhoneBook;

/**
 * Задание 5*: Написать программу-телефонную книгу, обладающую следующими функциями:
 * 1.	Создание и сохранение новых контактов с информацией:
 * 	Имя;
 * 	Фамилия;
 * 	Прозвище;
 * 	Номера телефонов (домашний, рабочий, мобильный, факс);
 * 	Электронные адреса;
 * 	Год рождения.
 * 2.	Просмотр ранее сохраненных контактов с возможностью просмотра всех данных контакта.
 * 3.	Поиск контакта по номеру телефона или имени.
 * 4.	Валидация контактов:
 * 	Проверка наличия уникальных номеров телефонов для каждого контакта;
 * 	Проверка корректности электронных адресов.
 * 5.	Возможность сохранения и загрузки списка контактов из файла для дальнейшего использования.
 */
public class Task5_PhoneBook {
    public static void main(String[] args) {
        PhoneBook book = new PhoneBook();


    }
}
